app/controllers/gifts_controller.rb

SELECT * FROM `gifts`
---
  def index
    @gifts = Gift.all

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
---
  def show
    @gift = Gift.find(params[:id])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
---
  def edit
    @gift = Gift.find(params[:id])

INSERT INTO `gifts` (`price`, `name`, `num_purchased`, `num_requested`, `created_at`, `giftlist_id`, `updated_at`, `url`, `user_id`, `description`) VALUES(45, NULL, NULL, 2, '2009-10-12 21:34:35', 1, '2009-10-12 21:34:35', 'www.amazon.com', NULL, 'Fart book')
---
  def create
    @gift = Gift.new(params[:gift])

    respond_to do |format|
      if @gift.save

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
UPDATE `gifts` SET `updated_at` = '2009-10-09 21:37:39', `name` = 'Poop Book', `num_requested` = 4, `num_purchased` = 0, `description` = 'Poop book', `url` = 'www.google.com' WHERE `id` = 2
---
  def update
    @gift = Gift.find(params[:id])

    respond_to do |format|
      if @gift.update_attributes(params[:gift])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 20)
DELETE FROM `gifts` WHERE `id` = 20
---
  def destroy
    @gift = Gift.find(params[:id])
    @gift.destroy