app/controllers/giftlists_controller.rb

SELECT * FROM `giftlists`
---
  def index
    @giftlists = Giftlist.all

SELECT * FROM `giftlists` WHERE (`giftlists`.`id` = 1)
---
  def show
    @giftlist = Giftlist.find(params[:id])

SELECT * FROM `giftlists` WHERE (`giftlists`.`id` = 1)
---
  def edit
    @giftlist = Giftlist.find(params[:id])

INSERT INTO `giftlists` (`created_at`, `updated_at`, `giftlist_name`, `user_id`) VALUES('2009-10-08 01:09:46', '2009-10-08 01:09:46', 'Christmas', 1)
---
  def create
    @giftlist = Giftlist.new(params[:giftlist])

    respond_to do |format|
      if @giftlist.save