app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
---
	def add_giftlist_dialog
		@user = User.find(:first, :conditions => ["username = ?", session[:user]])

INSERT INTO `giftlists` (`created_at`, `updated_at`, `giftlist_name`, `user_id`, `description`, `hidden`) VALUES('2009-12-08 02:59:59', '2009-12-08 02:59:59', 'Christmas List', 3, NULL, NULL)
---
	def add_giftlist
		@giftlist = Giftlist.new
		@giftlist.giftlist_name = params[:input_name]
		@giftlist.user_id = params[:input_user_id]
		@giftlist.hidden = params[:input_hidden]
		@giftlist.save

SELECT * FROM `giftlists` WHERE (id = NULL) LIMIT 1
SELECT * FROM `users` WHERE (id = '3') LIMIT 1
SELECT * FROM `gifts` WHERE (id = '9') LIMIT 1
DELETE FROM `gifts` WHERE (`id` IN (9))
---
	def delete_gift
		@giftlist = Giftlist.find(:first, :conditions => ["id = ?", params[:giftlist]])
		@user = User.find(:first, :conditions => ["id = ?", params[:id]])
		@gift = Gift.find(:first, :conditions => ["id = ?", params[:gift_id]])
		@gift.delete

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
---
	def search_users
		@users = User.find(:all, :conditions => ["username = ?", params[:search]])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `gifts` WHERE (user_id = -617257238)
SELECT * FROM `giftlists` WHERE (user_id = 3)
---
	def show_gifts
		if (params[:id])
			@user = User.find(:first, :conditions => ["username = ?", params[:id]])
		else
			@user = User.find(:first, :conditions => ["user_id = ?", params[:user_id]])
		end
		@gifts = Gift.find(:all, :conditions => ["user_id = ?", @user.id])
		@giftlists = Giftlist.find(:all, :conditions => ["user_id = ?", @user.id])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `giftlists` WHERE (id = '1') LIMIT 1
---
	def add_gift_dialog
		@user = User.find(:first, :conditions => ["username = ?", session[:user]])
		@giftlist = Giftlist.find(:first, :conditions => ["id = ?", params[:giftlist_id]])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `giftlists` WHERE (giftlist_name = 'My Giftlist' and user_id = 3) LIMIT 1
SELECT * FROM `gifts` WHERE (giftlist_id = -617428388 and user_id = 3)
---
	def rss
		@user = User.find(:first, :conditions => ["username = ?", params[:id]])
		@giftlist = Giftlist.find(:first, :conditions => ["giftlist_name = ? and user_id = ?", params[:giftlist], @user.id])
		@gifts = Gift.find(:all, :conditions => ["giftlist_id = ? and user_id = ?", @giftlist.id, @user.id])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `giftlists` WHERE (giftlist_name = 'My Giftlist' and user_id = 3) LIMIT 1
SELECT * FROM `gifts` WHERE (giftlist_id = 1 and user_id = 3)
---
	def show_giftlist
		@user = User.find(:first, :conditions => ["username = ?", params[:id]])
		@giftlist = Giftlist.find(:first, :conditions => ["giftlist_name = ? and user_id = ?", params[:giftlist], @user.id])
		@gifts = Gift.find(:all, :conditions => ["giftlist_id = ? and user_id = ?", @giftlist.id, @user.id])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `gifts` WHERE (`gifts`.`id` = '--- :gift\n')
---
	def show_gift
		@user = User.find(:first, :conditions => ["username = ?", params[:id]])
		@gift = Gift.find(params[:gift])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 5)
UPDATE `gifts` SET `updated_at` = '2009-11-02 23:26:10', `num_purchased` = 1 WHERE `id` = 5
---
	def purchased_gift
		@gift = Gift.find(params[:gift])
		@gift.num_purchased = @gift.num_purchased + 1
		@gift.save

SELECT * FROM `users` WHERE (`users`.`username` = '') LIMIT 1
SELECT * FROM `measurements` WHERE (user_id = 3) LIMIT 1
---
	def admin
		if(session[:user])
			@user = User.find(:first, :conditions => ["username = ?", session[:user]])
			@measurement = Measurement.find(:first, :conditions => ["user_id = ?", @user.id])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
SELECT * FROM `measurements` WHERE (user_id = 3) LIMIT 1
SELECT * FROM `giftlists` WHERE (user_id = 3)
---
	def manage_giftlists
		if(session[:user])
			@user = User.find(:first, :conditions => ["username = ?", session[:user]])
			@measurement = Measurement.find(:first, :conditions => ["user_id = ?", @user.id])
			@giftlists = Giftlist.find(:all, :conditions => ["user_id = ?", @user.id])

SELECT * FROM `users` WHERE (username = 'clebens') LIMIT 1
---
	def user_gift_entry
		if session[:user]
			@user = User.find(:first, :conditions => ["username = ?", session[:user]])

INSERT INTO `users` (`salt`, `created_at`, `email_addr`, `updated_at`, `username`, `hashed_password`) VALUES('-6162846880.123770673809845', '2009-10-12 19:07:21', 'colin.lebens@gmail.com', '2009-10-12 19:07:21', 'clebens', 'db95e7919feda4b9e4c45f3522b3399c7001ce2c')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `giftlists` WHERE (id = '1') LIMIT 1
SELECT * FROM `users` WHERE (id = '3') LIMIT 1
SELECT * FROM `gifts` WHERE (giftlist_id = '1' AND user_id = '3')
INSERT INTO `gifts` (`user_id`, `giftlist_id`, `price`, `url`, `description`, `num_purchased`, `num_requested`, `created_at`, `updated_at`, `name`, `ranking`) VALUES(1, 1, 0.0, 'http://www.brains.com', 'These are zombies', 0, 4, '2009-12-07 19:58:00', '2009-12-07 19:58:00', 'Zombies', 1)
---
	def add_new_gift()
		if (session[:user])
			@giftlist = Giftlist.find(:first, :conditions => ["id = ?", params[:giftlist_id]])
			@user = User.find(:first, :conditions => ["id = ?", params[:user_id]])
			@gifts = Gift.find(:all, :conditions => ["giftlist_id = ? AND user_id = ?", params[:giftlist_id], params[:user_id]])
			@gift = Gift.new
			@gift.name = params[:name]
			@gift.price = params[:price]
			@gift.url = params[:url]
			@gift.user_id = params[:user_id]
			@gift.description = params[:description]
			@gift.giftlist_id = params[:giftlist_id]
			@gift.num_requested = params[:num_requested]
			@gift.num_purchased = 0
			@gift.ranking = find_next_ranking(params[:user_id], params[:giftlist_id])
			@gift.save

SELECT * FROM `giftlists` WHERE (id = -617197968) LIMIT 1
SELECT * FROM `users` WHERE (id = 3) LIMIT 1
UPDATE `giftlists` SET `hidden` = 1, `updated_at` = '2009-10-29 19:17:38' WHERE `id` = 1
---
	def giftlist_hide
		list_item = Giftlist.find(:first, :conditions => ["id = ?", params[:giftlist]])
		user = User.find(:first, :conditions => ["id = ?", list_item.user_id])
		url = "/", user.username, "/manage_giftlists"
		list_item.hidden = 1
		list_item.save

SELECT * FROM `giftlists` WHERE (id = '1') LIMIT 1
SELECT * FROM `users` WHERE (id = 3) LIMIT 1
UPDATE `giftlists` SET `hidden` = 0, `updated_at` = '2009-10-29 19:17:41' WHERE `id` = 1
---
	def giftlist_unhide
		list_item = Giftlist.find(:first, :conditions => ["id = ?", params[:giftlist]])
		user = User.find(:first, :conditions => ["id = ?", list_item.user_id])
		url = "/", user.username, "/manage_giftlists"
		list_item.hidden = 0
		list_item.save

SELECT count(*) AS count_all FROM `gifts` WHERE (user_id = '3' and giftlist_id = '1')
---
	def find_next_ranking(user_id, giftlist_id)
		Gift.count(:all, :conditions => ["user_id = ? and giftlist_id = ?", user_id, giftlist_id]) + 1